Repository: bytehexe/mkmapdiary
Catalog: src/mkmapdiary/locale/*/LC_MESSAGES/messages.po
Languages: de

# site_name
source: Travel Diary
de: Reisetagebuch

# gallery_title
source: Gallery
de: Galerie

# map_title
source: Map
de: Karte

# journal_title
source: Journal
de: Tagebuch

# home_title
source: Home
de: Startseite

# days_title
source: Days
de: Tage

# generate_title_prompt
source: Create exactly one title that summarizes the following text in English. The title must be a single phrase, 3â€“5 words long. Use only words or phrases, or concepts that appear in the text. If the text contains multiple topics, combine them in a single title, separated naturally (e.g., with commas or conjunctions). Focus on the most important topics if all cannot fit in the title. Do not produce multiple titles, or explanations. Do not include phrases like 'Here is' or 'Summary'. If the text is empty or does not contain any useful information, leave your response empty. Do not invent information not present in the text. Output only the title, nothing else. Text: {text}
de: Erstelle genau einen Titel, der den folgenden Text auf Deutsch zusammenfasst. Der Titel muss ein einziger Ausdruck sein, 3–5 Wörter lang. Verwende nur Wörter oder Phrasen oder Konzepte, die im Text vorkommen. Wenn der Text mehrere Themen enthält, kombiniere sie in einem einzigen Titel, natürlich getrennt (z.B. mit Kommas oder Konjunktionen). Konzentriere dich auf die wichtigsten Themen, wenn nicht alle in den Titel passen. Erstelle keine mehreren Titel oder Erklärungen. Verwende keine Phrasen wie 'Hier ist' oder 'Zusammenfassung'. Wenn der Text leer ist oder keine nützlichen Informationen enthält, lasse deine Antwort leer. Erfinde keine Informationen, die nicht im Text vorhanden sind. Gib nur den Titel aus, sonst nichts. Text: {text}

# generate_tags_prompt
source: Extract a list of relevant tags in English from the following text. The list should not exceed 15 tags. Produce a single list of tags, separated by commas. Do not include explanations or additional text. Output only the list of tags, nothing else. If the text is empty or does not contain any useful information, leave your response empty. Do not include phrases like 'Tags:' or 'The tags are'. Text: {text}
de: Extrahiere eine Liste relevanter Tags auf Deutsch aus dem folgenden Text. Die Liste sollte nicht mehr als 15 Tags enthalten. Erstelle eine einzige Liste von Tags, getrennt durch Kommas. Füge keine Erklärungen oder zusätzlichen Text hinzu. Gib nur die Liste der Tags aus, sonst nichts. Wenn der Text leer ist oder keine nützlichen Informationen enthält, lasse deine Antwort leer. Verwende keine Phrasen wie 'Tags:' oder 'Die Tags sind'. Text: {text}

# summarize_journal_entry_prompt
source: Can you classify the following text? Please resond with an XML object containing the answer. Language of the XML is English. Do not prefix titles with 'audio:' or 'text:' etc. Output Example: {example} Text: {text}
de: Kannst du den folgenden Text klassifizieren? Bitte antworte mit einem XML-Objekt, das die Antwort enthält. Sprache des XML ist auf deutsch. Prefixe den Titel nicht mit 'Text:' oder 'Audio:', etc. Ausgabe-Beispiel: {example} Text: {text}

# summarize_image_prompt
source: Can you classify the following image? Please resond with an XML object containing the answer. Language of the XML is English. Do not prefix titles with 'image:' etc. Output Example: {example}
de: Kannst du das folgende Bild klassifizieren? Bitte antworte mit einem XML-Objekt, das die Antwort enthält. Sprache des XML ist auf deutsch. Prefixe den Titel nicht mit 'Bild:', etc. Ausgabe-Beispiel: {example}

# assess_image_quality_prompt
source: Can you assess the quality of the image from a photographers perspective? Please resond with an XML object containing the answer. Each field should contain a rating from 1 to 10. Output Example: {example}
de: Kannst du die Qualität des Bildes aus fotografischer Sicht bewerten? Bitte antworte mit einem XML-Objekt, das die Antwort enthält. Jedes Feld sollte eine Bewertung von 1 bis 10 enthalten. Ausgabe-Beispiel: {example}

source: Zoom to fit
de: Auf Größe zoomen

source: Download GPX
de: GPX herunterladen

# legend_track
source: Track
de: Route

# legend_waypoints
source: Waypoints
de: Wegpunkte

# legend_activity_areas
source: Activity areas
de: Aktivitätsbereiche

# legend_journal_entries
source: Journal entries
de: Tagebucheinträge

# overview_title
source: Overview
de: Übersicht

source: Include duplicates
de: Duplikate einschließen

# include_low_quality
source: Include low quality photos
de: Fotos mit geringer Qualität einschließen

source: Show quality icons
de: Qualitätssymbole anzeigen
